[
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "1. The servant is dependent on his Lord #1",
        "description": "All human beings depend on Allah for their welfare and prevention of evil in various matters of their religion and world. Allah says (interpretation of the meaning): O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.",
        "translite": "",
        "translation": "",
        "reference": "Surah Al-Fatir 35:15",
        "video": false,
        "arabic": ""
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "2. The servant is dependent on his Lord #2",
        "description": "Prophet (ﷺ) used to say after every compulsory prayer, The servant will ask his Lord for all of his religiously and worldly needs, because the treasure of all things is in the hands of Allah. Allah says (interpretation of the meaning): “And there is not a thing but that with Us are its depositories, and We do not send it down except according to a known measure.” (Sura Al-Hijr 15:21) No one can withhold what Allah gives; And, no one can give what he resists.",
        "translite": "Laa ilaaha illallahu wahdahu laa sharika lahu, lahul-mulku wa lahul-hamdu wa huwa 'alaa kulli shay'in qadir. Allaahumma laa maani'a limaa a'taita wa laa mu'tia limaa mana'ta wa laa yanfa'u dhal-jaddi minka al-jaddu",
        "translation": "There is none worthy of worship except Allah alone with no partner or associate. He is the Dominion and to Him be all praise, and He is able to do all things. O Allah, one can withhold what You have given and none can give what You have withheld, and no wealth or fortune can benefit anyone for from You comes all wealth and fortune.",
        "reference": "Bukhari: 844",
        "video": true,
        "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اَللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "3. The reward of freeing of a slave",
        "description": "Say the following statement 10 times -",
        "translite": "Laa ilahaa illAllahu wahdahu laa sharika lahu, lahul-mulku wa lahul-hamdu wa huwa 'alaa kulli shay'in qadir",
        "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise, and He is Able to do all things. The Prophet (ﷺ) said: The person who says the above statement 10 times It would be as if he had freed four of Ishmael's (As) children from slavery.",
        "reference": "Bukhari: 6404",
        "video": true,
        "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "4. Allah's guidance #1",
        "description": "This is a fake description for item 4.",
        "translite": "Iyyaaka na'budu wa lyyaaka nasta'een",
        "translation": "It is You we worship and It is You we ask for help. He whom Allah guides is the [rightly] guided, but he whom He leaves astray - never will you find for him a protecting guide. (Surah Al-Kahf 18:17)",
        "reference": "Surah Al-Fatihah 1:5",
        "video": true,
        "arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "5. Allah's guidance #2",
        "description": "The Messenger of Allah (ﷺ) commenced the prayer when he got up at night. Then he said:",
        "translite": "Ihdini limakhtulifa fihi minal-haqqi bi'idhnika innaka tahdi man tasha'u ila siratim mustaqim",
        "translation": "Guide me through that which there has been difference concerning the truth, verily, You are upon a straight path.",
        "reference": "Muslim: 770",
        "video": true,
        "arabic": "اِهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "6. Allah's guidance #3",
        "description": "Messenger of Allah (ﷺ) commanded Mu'adh bin Jabal (RA) to recite this supplication after every (prescribed) prayer -",
        "translite": "Allaahumma 'a'innee 'alaa thikrika, wa shukrika, wahusni 'ibaadatik",
        "translation": "O Allah, help me to remember You, to give You thanks, and to perform Your worship in the best manner.",
        "reference": "Sahih (Albani). Abu Dawud: 1522",
        "video": true,
        "arabic": "اَللَّهُمَّ أَعِنِّيْ عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "7. Allah's guidance #4",
        "description": "The Messenger of Allah (ﷺ) commenced the prayer when he got up at night. Here is a part of it -",
        "translite": "Wahdini li ahsanil-akhlaaqi, la yahdi li ahsanihaa illa anta wasrif anni sayyi'ahaa laa yasrifu anni sayyi'ahaa illa anta",
        "translation": "Guide me to the best of manners for none can guide to the best of them but You. Protect me from bad manners for none can protect against them but You.",
        "reference": "Muslim: 771",
        "video": true,
        "arabic": "وَاهْدِنِيْ لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِيْ لِأَحْسَنِهَا إِلَّا أَنْتَ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "8. Allah's guidance #5",
        "description": "The Prophet (ﷺ) instructed Ali ibn Abi Talib (RA) to seek guidance and firmness from Allah -",
        "translite": "Allaahumma inni as'alukal huda was-sadaad",
        "translation": "O Allah, I beg of Thee righteousness and adhering to the straight path.",
        "reference": "Muslim: 2725",
        "video": true,
        "arabic": "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "9. Allah's guidance #6",
        "description": "Narrated Al-Hasan ibn Ali (RA): The Messenger of Allah (ﷺ) taught me some words that I say during the witr -",
        "translite": "Allahum-mahdinee feeman hadayta, wa 'aafinee feeman 'aafayta, wa tawallanee feeman tawallayta, wa baarik lee feemaa 'a'atayta, wa qinee sharra maa qadhayta, fa'innaka taqdhee wa laa yuqdhaa 'alayka, 'innahu laa yadhillu man waalayta, wa laa ya 'izzu man 'aadayta, tabaarakta Rabbanaa wa ta'aalayta",
        "translation": "O Allah, guide me with those whom You have guided, and strengthen me with those whom You have given strength. Take me to Your care with those whom You have taken to Your care. Bless me in what You have given me. Protect me from the evil You have ordained. Surely, You command and are not commanded, and none whom You have committed to Your care shall be humiliated and none whom You have taken as an enemy shall taste glory. You are Blessed, Our Lord, and Exalted.",
        "reference": "Sahih (Albani). Abu Dawud: 1425",
        "video": true,
        "arabic": "اَللَّهُمَّ اهْدِنِيْ فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِيْ فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ وَلَا يَعِزُّ مَنْ عَادَيْتَ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "10. Asking for forgiveness #1",
        "description": "Forgiveness for sins should be sought from Allah, for the most important thing a servant can ask his Lord for, is forgiveness for his sins or its inevitable consequence. Such as deliverance from Hell and entry into Paradise. The servant needs forgiveness from his Lord for his sins, because he makes mistakes every day and night and Allah alone can forgive all sins. The Messenger of Allah (ﷺ) said: My heart is invaded by unmindfulness, and I ask Allah's pardon a hundred times in the day.",
        "translite": "",
        "translation": "",
        "reference": "Sahih (Albani). Abu Dawud: 1515",
        "video": false,
        "arabic": ""
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "11. Asking for forgiveness #2",
        "description": "Narrated Abdullah ibn Umar (RA): We counted that the Messenger of Allah (ﷺ) would say this dua a hundred times during a meeting -",
        "translite": "Rabbighfirli wa tub `alayya innaka Antat-Tawwabur-Rahim",
        "translation": "O Allah forgive me and accept my repentance, for You are the Accepter of repentance, the Most Merciful.",
        "reference": "Sahih (Albani). Abu Dawud: 1516",
        "video": true,
        "arabic": "رَبِّ اغْفِرْ لِي وَتُبْ عَلَىَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيْمُ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "12. Asking for forgiveness #3",
        "description": "",
        "translite": "Astaghfirullaa hal-'Adheemal-ladhee laa 'ilaaha 'illaa Huwal-Hayyul-Qayyoomu wa 'atoobu 'ilayhi",
        "translation": "I seek the forgiveness of Allah the Mighty, Whom there is none worthy of worship except Him, the Living, the Eternal, and I repent to Him. The Prophet (ﷺ) said, Whoever says, 'I seek forgiveness from Allah, the Exalted, there is no god but He, the Ever-Living, the Everlasting, and I repent to Him', is forgiven even if he flees from the battlefield.",
        "reference": "Sahih (Albani). Tirmidhi: 3577",
        "video": true,
        "arabic": "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَىُّ الْقَيُّوْمُ وَأَتُوبُ إِلَيْهِ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "13. Ask for paradise & seek refuge from fire",
        "description": "",
        "translite": "Allaahumma 'innee 'as'alukal-jannata wa 'a'oodhu bika minan-naar",
        "translation": "O Allah, I ask You for Paradise and seek Your protection from the Fire. Narrated by Abu Huraira (RA): The Messenger of Allah (ﷺ), asked a man, What do you supplicate in your prayer? The man says, I recite Tashahhud and say- (The dua is mentioned above) I can’t recite dua as beautifully as you, nor can I recite dua like Mu'adh! Then Prophet (ﷺ) said, “We also supplicate like you!”",
        "reference": "Sahih (Albani). Ibn Majah: 910",
        "video": true,
        "arabic": "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ"
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "14. Seeking good of this world and the hereafter",
        "description": "",
        "translite": "",
        "translation": "Al-`Abbas bin `Abdul-Muttalib (RA) said: “I said: ‘O Messenger of Allah (ﷺ), teach me something that I may ask Allah, [Mighty and Sublime] for.’ He (ﷺ) said: ‘Ask Allah for Al-`Āfiyah.’ Then I remained for a day, then I came and said: ‘O Messenger of Allah (ﷺ), teach me something that I may ask Allah for.’ So he (ﷺ) said to me: “O Abbas, O uncle of the Messenger of Allah! Ask Allah for Al-`Āfiyah in the world and in the Hereafter.” [1] Narrated by Abu Bakr Siddiq (RA): The Prophet (ﷺ) said (sitting) on the pulpit, Seek forgiveness and healing from Allah, for no one has been given anything better than healing after Yaqeen. [2]",
        "reference": "[1] Sahih (Albani). Tirmidhi: 3514 [2] Bukhari, Al-Adabul Mufrad, 724",
        "video": false,
        "arabic": ""
      },
      {
        "img": "https://i.ibb.co/YTLMXk6/Allah-Name.png",
        "title": "15. To get Stability in religion and good results in all deeds",
        "description": "",
        "translite": "Allaahumma musarrifal-qulubi, sarrif qulubana 'ala ta'atik",
        "translation": "O Allah! Controller of the hearts, direct our hearts to Your obedience. Abdullah bin Amr bin al-'As (RA) reported that he heard Allah's Messenger (ﷺ) as saying: Verily, the hearts of all the sons of Adam are between the two fingers out of the fingers of the Compassionate Lord as one heart. He turns that to any (direction) He likes. Then Allah’s Messenger (ﷺ) said: (Dua mentioned above)",
        "reference": "Muslim: 2655",
        "video": true,
        "arabic": "اَللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ"
      }
    ]
  